tap "1password/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "romkatv/powerlevel10k"
tap "homebrew/cask-fonts"
brew "readline"
brew "xz"
brew "awscli"
brew "bat"
brew "direnv"
brew "docker"
brew "entr"
brew "fd"
brew "git-delta"
brew "git-lfs"
brew "lazygit"
brew "nvm"
brew "openssl@3"
brew "pgcli"
brew "postgresql@13"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "yadm"
brew "zlib"
brew "jesseduffield/lazydocker/lazydocker"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password-cli"
cask "dbeaver-community"
cask "docker"
cask "font-fira-code-nerd-font"
cask "iterm2"
